Output from `terraform plan`
```
          + script_location = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/scripts/digital-prison-reporting-jobs-vLatest.scala"
        }

      + execution_property {
          + max_concurrent_runs = 1
        }
    }

  # module.reconciliation-jobs["sentence"].module.glue_s3_data_reconciliation_job.aws_glue_security_configuration.sec_cfg[0] will be created
  + resource "aws_glue_security_configuration" "sec_cfg" {
      + id   = (known after apply)
      + name = "dpr-reconciliation-sentence-sec-config"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "DISABLED"
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "DISABLED"
            }
          + s3_encryption {
              + kms_key_arn        = "arn:aws:kms:eu-west-2:972272129531:key/7f78035f-f870-41b2-b00b-b7398cd6eb2d"
              + s3_encryption_mode = "SSE-KMS"
            }
        }
    }

  # module.reconciliation-jobs["sentence"].module.glue_s3_data_reconciliation_job.aws_iam_policy.additional-policy[0] will be created
  + resource "aws_iam_policy" "additional-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Extra Policy for AWS Glue Job"
      + id               = (known after apply)
      + name             = "dpr-reconciliation-sentence-preproduction-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::dpr-*/*",
                          + "arn:aws:s3:::dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "logs:AssociateKmsKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:/aws-glue/*"
                    },
                  + {
                      + Action   = [
                          + "sqs:*",
                          + "iam:ListRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:GetRole",
                          + "glue:*",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dms:StopReplicationTask",
                          + "dms:DescribeTableStatistics",
                          + "dms:DescribeReplicationTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dms:eu-west-2:972272129531:*:*"
                    },
                  + {
                      + Action   = [
                          + "kinesis:SubscribeToShard",
                          + "kinesis:ListShards",
                          + "kinesis:GetShardIterator",
                          + "kinesis:GetRecords",
                          + "kinesis:DescribeStream",
                          + "kinesis:DescribeLimits",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-nomis-source-secrets-JW0xQK",
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-rds-operational-db-secret-SLvlRb",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:DescribeKey",
                          + "kms:Decrypt*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Update*",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:Get*",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DescribeStream",
                          + "dynamodb:Delete*",
                          + "dynamodb:CreateTable",
                          + "dynamodb:BatchWrite*",
                          + "dynamodb:BatchGet*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.reconciliation-jobs["sentence"].module.glue_s3_data_reconciliation_job.aws_iam_role.glue-service-role[0] will be created
  + resource "aws_iam_role" "glue-service-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reconciliation-sentence-preproduction-glue-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "sentence"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all              = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "sentence"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.reconciliation-jobs["sentence"].module.glue_s3_data_reconciliation_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::972272129531:policy/dpr-reconciliation-sentence-preproduction-policy"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr-reconciliation-sentence-preproduction-policy"
      + role       = "dpr-reconciliation-sentence-preproduction-glue-role"
    }

  # module.reconciliation-jobs["sentence"].module.glue_s3_data_reconciliation_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "dpr-reconciliation-sentence-preproduction-glue-role"
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.continuous_log[0] will be created
  + resource "aws_cloudwatch_log_group" "continuous_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-transactions-preproduction-dpr-reconciliation-transactions-sec-config"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.job[0] will be created
  + resource "aws_cloudwatch_log_group" "job" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-transactions-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-transactions-sec-config"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config_error[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config_error" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-transactions-sec-config-role/dpr-reconciliation-transactions-preproduction-glue-role/error"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config_output[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config_output" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-transactions-sec-config-role/dpr-reconciliation-transactions-preproduction-glue-role/output"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_glue_job.glue_job[0] will be created
  + resource "aws_glue_job" "glue_job" {
      + arn                    = (known after apply)
      + connections            = [
          + "dpr-operational-datastore-connection",
          + "dpr-nomis-connection",
        ]
      + default_arguments      = {
          + "--TempDir"                                                   = "s3://dpr-glue-jobs-preproduction/tmp/dpr-reconciliation-transactions-preproduction/"
          + "--class"                                                     = "uk.gov.justice.digital.job.DataReconciliationJob"
          + "--continuous-log-logGroup"                                   = "/aws-glue/jobs/dpr-reconciliation-transactions-preproduction"
          + "--dpr.aws.region"                                            = "eu-west-2"
          + "--dpr.config.key"                                            = "transactions"
          + "--dpr.config.s3.bucket"                                      = "dpr-glue-jobs-preproduction"
          + "--dpr.contract.registryName"                                 = "dpr-schema-registry-preproduction"
          + "--dpr.curated.s3.path"                                       = "s3://dpr-curated-zone-preproduction/"
          + "--dpr.dms.replication.task.id"                               = "dpr-dms-nomis-oracle-s3-transactions-task-preproduction"
          + "--dpr.log.level"                                             = "INFO"
          + "--dpr.operational.data.store.glue.connection.name"           = "dpr-operational-datastore-connection"
          + "--dpr.operational.data.store.jdbc.batch.size"                = "5000"
          + "--dpr.operational.data.store.loading.schema.name"            = "loading"
          + "--dpr.operational.data.store.tables.to.write.table.name"     = "configuration.datahub_managed_tables"
          + "--dpr.operational.data.store.write.enabled"                  = "true"
          + "--dpr.raw.archive.s3.path"                                   = "s3://dpr-raw-archive-preproduction/"
          + "--dpr.raw.s3.path"                                           = "s3://dpr-raw-zone-preproduction/"
          + "--dpr.reconciliation.checks.to.run"                          = "current_state_counts,change_data_counts"
          + "--dpr.reconciliation.datasource.glue.connection.name"        = "dpr-nomis-connection"
          + "--dpr.reconciliation.datasource.should.uppercase.tablenames" = "true"
          + "--dpr.reconciliation.datasource.source.schema.name"          = "OMS_OWNER"
          + "--dpr.structured.s3.path"                                    = "s3://dpr-structured-zone-preproduction/"
          + "--enable-continuous-cloudwatch-log"                          = "false"
          + "--enable-continuous-log-filter"                              = "false"
          + "--enable-glue-datacatalog"                                   = "true"
          + "--enable-job-insights"                                       = "true"
          + "--extra-files"                                               = "s3://dpr-glue-jobs-preproduction/logging/ingestion-jobs/log4j2.properties"
          + "--extra-jars"                                                = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/jars/digital-prison-reporting-jobs-vLatest-all.jar"
          + "--job-bookmark-option"                                       = "job-bookmark-disable"
          + "--job-language"                                              = "scala"
          + "--spark-event-logs-path"                                     = "s3://dpr-glue-jobs-preproduction/spark-logs/dpr-reconciliation-transactions-preproduction/"
        }
      + description            = <<-EOT
            Reconciles data across DataHub.
            Arguments:
            --dpr.config.key: (Required) config key e.g. prisoner
            --dpr.dms.replication.task.id: (Required) ID of the DMS replication task to reconcile against the raw zone
            --dpr.reconciliation.checks.to.run: (Optional) Allows restricting the set of checks that will be run
        EOT
      + execution_class        = "STANDARD"
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + max_retries            = 0
      + name                   = "dpr-reconciliation-transactions-preproduction"
      + number_of_workers      = 2
      + role_arn               = (known after apply)
      + security_configuration = (known after apply)
      + tags                   = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all               = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = (known after apply)
          + runtime         = (known after apply)
          + script_location = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/scripts/digital-prison-reporting-jobs-vLatest.scala"
        }

      + execution_property {
          + max_concurrent_runs = 1
        }
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_glue_security_configuration.sec_cfg[0] will be created
  + resource "aws_glue_security_configuration" "sec_cfg" {
      + id   = (known after apply)
      + name = "dpr-reconciliation-transactions-sec-config"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "DISABLED"
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "DISABLED"
            }
          + s3_encryption {
              + kms_key_arn        = "arn:aws:kms:eu-west-2:972272129531:key/7f78035f-f870-41b2-b00b-b7398cd6eb2d"
              + s3_encryption_mode = "SSE-KMS"
            }
        }
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_iam_policy.additional-policy[0] will be created
  + resource "aws_iam_policy" "additional-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Extra Policy for AWS Glue Job"
      + id               = (known after apply)
      + name             = "dpr-reconciliation-transactions-preproduction-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::dpr-*/*",
                          + "arn:aws:s3:::dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "logs:AssociateKmsKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:/aws-glue/*"
                    },
                  + {
                      + Action   = [
                          + "sqs:*",
                          + "iam:ListRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:GetRole",
                          + "glue:*",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dms:StopReplicationTask",
                          + "dms:DescribeTableStatistics",
                          + "dms:DescribeReplicationTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dms:eu-west-2:972272129531:*:*"
                    },
                  + {
                      + Action   = [
                          + "kinesis:SubscribeToShard",
                          + "kinesis:ListShards",
                          + "kinesis:GetShardIterator",
                          + "kinesis:GetRecords",
                          + "kinesis:DescribeStream",
                          + "kinesis:DescribeLimits",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-nomis-source-secrets-JW0xQK",
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-rds-operational-db-secret-SLvlRb",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:DescribeKey",
                          + "kms:Decrypt*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Update*",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:Get*",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DescribeStream",
                          + "dynamodb:Delete*",
                          + "dynamodb:CreateTable",
                          + "dynamodb:BatchWrite*",
                          + "dynamodb:BatchGet*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_iam_role.glue-service-role[0] will be created
  + resource "aws_iam_role" "glue-service-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reconciliation-transactions-preproduction-glue-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all              = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "transactions"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::972272129531:policy/dpr-reconciliation-transactions-preproduction-policy"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr-reconciliation-transactions-preproduction-policy"
      + role       = "dpr-reconciliation-transactions-preproduction-glue-role"
    }

  # module.reconciliation-jobs["transactions"].module.glue_s3_data_reconciliation_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "dpr-reconciliation-transactions-preproduction-glue-role"
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.continuous_log[0] will be created
  + resource "aws_cloudwatch_log_group" "continuous_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-visits-preproduction-dpr-reconciliation-visits-sec-config"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.job[0] will be created
  + resource "aws_cloudwatch_log_group" "job" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-visits-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-visits-sec-config"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config_error[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config_error" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-visits-sec-config-role/dpr-reconciliation-visits-preproduction-glue-role/error"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_cloudwatch_log_group.sec_config_output[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config_output" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reconciliation-visits-sec-config-role/dpr-reconciliation-visits-preproduction-glue-role/output"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_glue_job.glue_job[0] will be created
  + resource "aws_glue_job" "glue_job" {
      + arn                    = (known after apply)
      + connections            = [
          + "dpr-operational-datastore-connection",
          + "dpr-nomis-connection",
        ]
      + default_arguments      = {
          + "--TempDir"                                                   = "s3://dpr-glue-jobs-preproduction/tmp/dpr-reconciliation-visits-preproduction/"
          + "--class"                                                     = "uk.gov.justice.digital.job.DataReconciliationJob"
          + "--continuous-log-logGroup"                                   = "/aws-glue/jobs/dpr-reconciliation-visits-preproduction"
          + "--dpr.aws.region"                                            = "eu-west-2"
          + "--dpr.config.key"                                            = "visits"
          + "--dpr.config.s3.bucket"                                      = "dpr-glue-jobs-preproduction"
          + "--dpr.contract.registryName"                                 = "dpr-schema-registry-preproduction"
          + "--dpr.curated.s3.path"                                       = "s3://dpr-curated-zone-preproduction/"
          + "--dpr.dms.replication.task.id"                               = "dpr-dms-nomis-oracle-s3-visits-task-preproduction"
          + "--dpr.log.level"                                             = "INFO"
          + "--dpr.operational.data.store.glue.connection.name"           = "dpr-operational-datastore-connection"
          + "--dpr.operational.data.store.jdbc.batch.size"                = "5000"
          + "--dpr.operational.data.store.loading.schema.name"            = "loading"
          + "--dpr.operational.data.store.tables.to.write.table.name"     = "configuration.datahub_managed_tables"
          + "--dpr.operational.data.store.write.enabled"                  = "true"
          + "--dpr.raw.archive.s3.path"                                   = "s3://dpr-raw-archive-preproduction/"
          + "--dpr.raw.s3.path"                                           = "s3://dpr-raw-zone-preproduction/"
          + "--dpr.reconciliation.checks.to.run"                          = "current_state_counts,change_data_counts"
          + "--dpr.reconciliation.datasource.glue.connection.name"        = "dpr-nomis-connection"
          + "--dpr.reconciliation.datasource.should.uppercase.tablenames" = "true"
          + "--dpr.reconciliation.datasource.source.schema.name"          = "OMS_OWNER"
          + "--dpr.structured.s3.path"                                    = "s3://dpr-structured-zone-preproduction/"
          + "--enable-continuous-cloudwatch-log"                          = "false"
          + "--enable-continuous-log-filter"                              = "false"
          + "--enable-glue-datacatalog"                                   = "true"
          + "--enable-job-insights"                                       = "true"
          + "--extra-files"                                               = "s3://dpr-glue-jobs-preproduction/logging/ingestion-jobs/log4j2.properties"
          + "--extra-jars"                                                = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/jars/digital-prison-reporting-jobs-vLatest-all.jar"
          + "--job-bookmark-option"                                       = "job-bookmark-disable"
          + "--job-language"                                              = "scala"
          + "--spark-event-logs-path"                                     = "s3://dpr-glue-jobs-preproduction/spark-logs/dpr-reconciliation-visits-preproduction/"
        }
      + description            = <<-EOT
            Reconciles data across DataHub.
            Arguments:
            --dpr.config.key: (Required) config key e.g. prisoner
            --dpr.dms.replication.task.id: (Required) ID of the DMS replication task to reconcile against the raw zone
            --dpr.reconciliation.checks.to.run: (Optional) Allows restricting the set of checks that will be run
        EOT
      + execution_class        = "STANDARD"
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + max_retries            = 0
      + name                   = "dpr-reconciliation-visits-preproduction"
      + number_of_workers      = 2
      + role_arn               = (known after apply)
      + security_configuration = (known after apply)
      + tags                   = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all               = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = (known after apply)
          + runtime         = (known after apply)
          + script_location = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/scripts/digital-prison-reporting-jobs-vLatest.scala"
        }

      + execution_property {
          + max_concurrent_runs = 1
        }
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_glue_security_configuration.sec_cfg[0] will be created
  + resource "aws_glue_security_configuration" "sec_cfg" {
      + id   = (known after apply)
      + name = "dpr-reconciliation-visits-sec-config"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "DISABLED"
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "DISABLED"
            }
          + s3_encryption {
              + kms_key_arn        = "arn:aws:kms:eu-west-2:972272129531:key/7f78035f-f870-41b2-b00b-b7398cd6eb2d"
              + s3_encryption_mode = "SSE-KMS"
            }
        }
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_iam_policy.additional-policy[0] will be created
  + resource "aws_iam_policy" "additional-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Extra Policy for AWS Glue Job"
      + id               = (known after apply)
      + name             = "dpr-reconciliation-visits-preproduction-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::dpr-*/*",
                          + "arn:aws:s3:::dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "logs:PutLogEvents",
                          + "logs:CreateLogStream",
                          + "logs:CreateLogGroup",
                          + "logs:AssociateKmsKey",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:/aws-glue/*"
                    },
                  + {
                      + Action   = [
                          + "sqs:*",
                          + "iam:ListRolePolicies",
                          + "iam:GetRolePolicy",
                          + "iam:GetRole",
                          + "glue:*",
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "dms:StopReplicationTask",
                          + "dms:DescribeTableStatistics",
                          + "dms:DescribeReplicationTasks",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dms:eu-west-2:972272129531:*:*"
                    },
                  + {
                      + Action   = [
                          + "kinesis:SubscribeToShard",
                          + "kinesis:ListShards",
                          + "kinesis:GetShardIterator",
                          + "kinesis:GetRecords",
                          + "kinesis:DescribeStream",
                          + "kinesis:DescribeLimits",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*"
                    },
                  + {
                      + Action   = [
                          + "secretsmanager:GetSecretValue",
                          + "secretsmanager:DescribeSecret",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:external/dpr-nomis-source-secrets-JW0xQK",
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
                          + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-rds-operational-db-secret-SLvlRb",
                        ]
                    },
                  + {
                      + Action   = [
                          + "kms:ReEncrypt*",
                          + "kms:GenerateDataKey*",
                          + "kms:Encrypt*",
                          + "kms:DescribeKey",
                          + "kms:Decrypt*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:kms:*:972272129531:key/*"
                    },
                  + {
                      + Action   = [
                          + "dynamodb:Update*",
                          + "dynamodb:Scan",
                          + "dynamodb:Query",
                          + "dynamodb:PutItem",
                          + "dynamodb:Get*",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DescribeStream",
                          + "dynamodb:Delete*",
                          + "dynamodb:CreateTable",
                          + "dynamodb:BatchWrite*",
                          + "dynamodb:BatchGet*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_iam_role.glue-service-role[0] will be created
  + resource "aws_iam_role" "glue-service-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reconciliation-visits-preproduction-glue-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all              = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "DPR2-1117"
          + "Name"           = "dpr-data-reconciliation-preproduction"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::972272129531:policy/dpr-reconciliation-visits-preproduction-policy"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr-reconciliation-visits-preproduction-policy"
      + role       = "dpr-reconciliation-visits-preproduction-glue-role"
    }

  # module.reconciliation-jobs["visits"].module.glue_s3_data_reconciliation_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "dpr-reconciliation-visits-preproduction-glue-role"
    }

Plan: 297 to add, 46 to change, 0 to destroy.

```